{
  "datasource": {
    "key": "web-services",
    "name": "Information about DADI products",
    "requestParams": [
      {
        "param": "product",
        "field": "product"
      },
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "A high-performance RESTful API layer designed in support of API-first development and the principles of COPE.",
          "description": [
            "**DADI API** is a rapid set-up data layer ready to act as the backbone to your digital platform. It is designed to be plugged into a templating layer, a mobile application or to be used with any other data consumer – and can be used alongside other apps in the DADI technology suite.",
            "It can contain your business/domain logic (the part of a platform that encodes the real-world business rules that determine how data is created, displayed, stored and changed). **DADI API** allows you to get a complete data layer up and running in minutes."
          ],
          "headlines": [
            "**Filter and sort** your data with ease",
            "**Flexible** database support",
            "Automatic document **versioning**",
            "Built in support for **oAuth2**"
          ],
          "features": [
            {
              "title": "Filter and sort your data with ease",
              "icon": "folder-open",
              "description": "Harness the power of MongoDB-style querying to filter and sort your data."
            },
            {
              "title": "Flexible database support",
              "icon": "database",
              "description": "Support for multiple database connectors including MongoDB, CouchDB and RethinkDB."
            },
            {
              "title": "Automatic database indexing",
              "icon": "list",
              "description": "Indexing your underlying database is as simple as adding configuration elements to collections."
            },
            {
              "title": "Automatic input validation",
              "icon": "happy",
              "description": "Easily configure fields within collections for input validation."
            },
            {
              "title": "Collection-level access control",
              "icon": "locked",
              "description": "With a fine-grained authorisation layer, control who can access data and how."
            },
            {
              "title": "Cache data for faster retrieval",
              "icon": "cloud-upload",
              "description": "Cache data using a Redis server or the local filesystem, providing faster response times."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "**API** can provide dynamic content for **Web**."
            },
            {
              "product": "publish",
              "description": "**Publish** provides an interface to edit content in **API**."
            }
          ]
        },
        {
          "lang": "en",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "A writer’s window to the world of content creation. Flexible interfaces designed to optimize editorial workflow.",
          "description": [
            "**DADI Publish** is developed to optimize editorial workflow with flexible interfaces that adapt to your requirements, meaning more time can be spent making content than wasting time managing it. It is built to support the [principles of COPE](./concepts/api-first-and-cope/) (Create Once Publish Everywhere).",
            "Journalists and editors can seamlessly manage output across multiple products from one place, while engineers can make light work of even complex content collections. Publish currently works with **DADI API** but our development roadmap will soon allow use with a variety of data stores."
          ],
          "headlines": [
            "Extendable **custom fields**",
            "Manage documents across **multiple APIs**",
            "Intuitive **in-browser editor** with the simple drag and drop tool",
            "**Background tasks** to manage big-data operations, analytics and much more"
          ],
          "features": [
            {
              "title": "Centralized media management",
              "icon": "picture",
              "description": "Power a suite of digital products from a single content store. Saves time and effort for engineers and editors alike."
            },
            {
              "title": "Article publish scheduling",
              "icon": "time",
              "description": "Pre-load content for automatic publishing at a time that suits the content, not your working day. Also create drafts for internal review."
            },
            {
              "title": "Setup and connect in 30 seconds",
              "icon": "database",
              "description": "The perfect partner for **DADI API** so you are up and running in days and weeks not weeks and months. Soon to work with other data stores."
            },
            {
              "title": "Custom user permissions",
              "icon": "locked",
              "description": "Enhanced features for large teams – keeping the right hands on the right parts of the system. Extends to support editorial workflow."
            },
            {
              "title": "Collaborative document editing",
              "icon": "user-new",
              "description": "See where colleagues are in shared articles and avoid treading on toes – work together seamlessly to update content."
            },
            {
              "title": "Revision history with quick revert",
              "icon": "rewind",
              "description": "Provides a complete audit trail allowing you to restore to any point in time. Document differentials provide an overview of changes."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "**API** can provide content for **Web**."
            },
            {
              "product": "publish",
              "description": "Content in **API** can be editied in **Publish**."
            }
          ]
        },
        {
          "lang": "en",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "A just-in-time asset manipulation and delivery layer designed as a modern, global content distribution solution.",
          "description": [
            "**DADI CDN** is analogous to a traditional CDN (Content Distribution Network) such as [Akamai](https://www.akamai.com/) and [Limelight](https://www.limelight.com/). It is designed to carry the processing and delivery load associated with image manipulation and asset delivery (CSS/JS/fonts) and acts autonomously as a layer on top of your core product.",
            "**CDN** has full support for caching, header control, image manipulation, image compression and image format conversion. An authenticated API allows for fine grained cache control in the form of content invalidation on an individual file or collective path basis."
          ],
          "headlines": [
            "Serve from **Amazon S3**, a remote server or the local filesystem",
            "Dynamically generate images for **responsive design** and mobile devices",
            "Extensive set of image **enhancement** and **transformation** tools",
            "Image **format conversion**"
          ],
          "features": [
            {
              "title": "Crop based on subject matter",
              "icon": "picture",
              "description": "Let CDN decide the focal point of the image and deliver an image containing only the essentials, cropped to your specifications."
            },
            {
              "title": "Simplified media storage",
              "icon": "database",
              "description": "No need to maintain multiple sizes of each image you upload into an article - CDN generates new variations from a single master image."
            },
            {
              "title": "One CDN for all asset types",
              "icon": "layers",
              "description": "Store and deliver font files and minify all your CSS and JavaScript assets for delivery."
            },
            {
              "title": "Intelligent delivery",
              "icon": "activity",
              "description": "Let CDN choose the best transformations based on device, network, location or language."
            },
            {
              "title": "Delivery Recipes",
              "icon": "id",
              "description": "Store frequently used image manipulation parameters as a 'delivery recipe'."
            },
            {
              "title": "Cache crops for faster delivery",
              "icon": "bolt",
              "description": "Converted images can be cached using a Redis server or the local filesystem, providing faster delivery on subsequent requests."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "**Publish** manages content stored in **API**."
            },
            {
              "product": "cdn",
              "description": "**Publish** uses **CDN** to store and maniuplate images."
            },
            {
              "product": "web",
              "description": "**Publish** can use **Web** to serve a front-end."
            }
          ]
        },
        {
          "lang": "en",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "A schemaless templating layer that can operate as a standalone platform or with API as a full stack web application.",
          "description": [
            "**DADI Web** makes it easy to build custom enterprise-grade web applications. Easily create static pages or connect to APIs to generate data-driven apps giving you the power to search, paginate, sort and filter your data, on the server or in browser.",
            "**DADI Web** can use a variety of templating languages, providing a simple yet powerful template layer for displaying your data. These include _LinkedIn’s_ [Dust](http://www.dustjs.com/), [Pug](https://pugjs.org/) or [Handlebars](http://handlebarsjs.com/) – or you can easily craft your own."
          ],
          "headlines": [
            "Connect with **REST APIs** to generate data-driven pages",
            "Search, paginate, sort and filter your data",
            "Easily create **static pages**",
            "Support for **database-backed** sessions"
          ],
          "features": [
            {
              "title": "Flexible template engine support",
              "icon": "chat-alt",
              "description": "Use Web's default Dust.js template engine or swap in one for Pug.js or Handlebars.js – even craft your own!"
            },
            {
              "title": "URL Rewriting Support",
              "icon": "duplicate",
              "description": "Includes Apache-like URL rewriting, with full support for redirects and proxying."
            },
            {
              "title": "Events Layer",
              "icon": "bolt",
              "description": "Create custom JavaScript events to modify the request and response, or take action based on data loaded from a source."
            },
            {
              "title": "Data from anywhere",
              "icon": "cloud",
              "description": "You're not limited to using DADI API - serve data from static Markdown files or retrieve feeds from Twitter and Wordpress."
            },
            {
              "title": "Preload Data",
              "icon": "fast-forward",
              "description": "Speed up access to commonly required data by preloading it when the application boots."
            },
            {
              "title": "Cache pages for faster retrieval",
              "icon": "performance",
              "description": "Cache data using a Redis server or the local filesystem, providing faster response times to users. Includes full support for Cache-Control headers."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "**Web** can display content from **API**."
            },
            {
              "product": "cdn",
              "description": "**Web** uses **CDN** to serve images, CSS and JS."
            }
          ]
        },
        {
          "lang": "de",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "Eine high-performance RESTful API Oberfläche, gestaltet mit Unterstützung der API-first Entwicklung und den Prinzipe von COPE.",
          "description": [
            "**DADI API** ist eine schnelle Setup Oberfläche, die bereit ist als Backbone ihrer digitalen Plattform zu agieren. Es ist so gestaltet, dass es in eine vorgefertige Oberfläche eingefügt werden kann, als mobile App benutzt werden kann oder mit jedem anderen Datenkonsumenten - und es kann Seite and Seite mit anderen Apps der DADI Technology Suite genutzt werden. ",
            "Es kann ihre Unternehmens/Domainlogik enthalten (Der Teil der Plattform, der die realweltlichen Geschäftsregeln kodiert, die bestimmen, wie Daten erstellt, angezeigt, gespeichert und geändert werden dürfen). **DADI API** ermöglicht es, eine komplette Datenoberfläche innerhalb von Minuten aufzusetzen und in Betrieb zu nehmen. "
          ],
          "headlines": [
            "**Filtert und sortert** die Daten mit Leichtigkeit",
            "**Flexibler** Datenbank Support",
            "Automatische **Dokumentenversionierung**",
            "Eingebaute Unterstützung für **oAuth2**"
          ],
          "features": [
            {
              "title": "Filtert und sortert die Daten mit Leichtigkeit",
              "icon": "folder-open",
              "description": "Macht sich die Fähigkeiten der MongoDB-Style Abfragen zunutze, um die Daten zu filtern und zu sortieren."
            },
            {
              "title": "Flexibler Datenbank Support",
              "icon": "database",
              "description": "Unterstützung für mehrere Datenbankenanschlüsse inklusive MongoDB, CouchDB und RethinkDB."
            },
            {
              "title": "Automatische Datenbankindexierung",
              "icon": "list",
              "description": "Indexieren der zugrundeliegende Datenbank ist genauso einfach wie das Hinzufügen von Konfigurationselementen zu den Sammlungen."
            },
            {
              "title": "Automatische Eingabevalidation",
              "icon": "happy",
              "description": "Einfache Konfigurationsfelder innerhalb der Sammlungen für Eingabevalidation."
            },
            {
              "title": "Zugriffskontrolle zu Sammlungsebenen",
              "icon": "locked",
              "description": "Mit einer feinkörnigen Autorisationsebene kann kontrolliert werden, wer Zugriff auf Daten hat und wie."
            },
            {
              "title": "Datencache für schnelleren Zugriff",
              "icon": "cloud-upload",
              "description": "Datencache, der entweder einen Redis Server oder das lokale Dateisystem benutzt, um schnellere Antwortzeiten zu ermöglichen"
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "**API** kann dynamischen Inhalt für **Web** bereitstellen."
            },
            {
              "product": "publish",
              "description": "**Publish** bietet eine Oberfläche, um Inhalte in **API** zu bearbeiten."
            }
          ]
        },
        {
          "lang": "de",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "Das Fenster zur Welt der Inhaltsschaffung eines Autors. Flexible Oberflächen, gestaltet um den editoriellen Workflow zu optimieren.",
          "description": [
            "**DADI Publish** wurde entwickelt, um den editoriellen Workflow mit flexiblen Oberflächen zu optimieren, die sich ihren Bedürfnissen anpassen, was bedeutet, dass mehr Zeit dafür bleibt, Inhalte zu erstellen als diese zu verwalten. Es unterstützt die [Prinzipien von COPE](./concepts/api-first-and-cope/) (Create Once Publish Everywhere).",
            "Journalisten und Editors können nahtlos ihren Output über mehrere Produkte hinweg von einem Ort aus verwalten, während Entwickler leichte Arbeit aus selbst komplexen Inhaltsammlungen machen können. Publish arbeitet zur Zeit mit **DADI API**, aber unser Entwicklungsplan sieht vor, dass es bald mit einer Vielfalt von Datenbanken benutzbar sein wird."
          ],
          "headlines": [
            "Erweiterbare **benutzerdefinierte Felder**", 
            "Verwaltet Dokumente über **mehrere APIs** hinweg",
            "Intuitiver **In-Browser Editor** mit einfachem Drag & Drop Tool",
            "**Hintergrundanwendungen** um große Datenaufkommen zu verwalten, zu analysieren und vieles mehr"
          ],
          "features": [
            {
              "title": "Zentrales Medienmanagement",
              "icon": "picture",
              "description": "Verfügen sie über eine Suite von digitalen Produkten von einem einzigen Content Store aus. Spart Zeit und Kraft für Entwickler und Editors gleichermaßen."
            },
            {
              "title": "Zeitplan für Artikelveröffentlichungen",
              "icon": "time",
              "description": "Laden sie Inhalte vor für die automatische Veröffentlichung zu einer Zeit, die dem Inhalt angemessen ist, und nicht ihrem Arbeitsalltag. Erstellt auch Entwürfe für interne Berichte."
            },
            {
              "title": "Setup und Verbindung in 30 Sekunden",
              "icon": "database",
              "description": "Der perfekte Partner für **DADI API**, sodass sie innerhalb von Tagen und Wochen aufgestellt und in Betrieb sind, nicht erst in Wochen oder Monaten. Arbeitet auch bald mit anderen Datenbanken."
            },
            {
              "title": "Benutzerdefinierte Zugangsberechtigungen",
              "icon": "locked",
              "description": "Erweiterte Features für große Teams - stellt sicher, dass die richtigen Hände Zugriff auf die entsprechenden Teile des Systems haben. Erweiterbar um den editoriellen Workflow zu unterstützen."
            },
            {
              "title": "Kollaborative Dokumentenbearbeitung",
              "icon": "user-new",
              "description": "Wissen, wo die Kollegen gerade in einem geteilten Artikel sind und somit verhindern, jemandem auf den Schlips zu treten - nahtlose Zusammenarbeit, um den Inhalt aktuell zu halten."
            },
            {
              "title": "Überarbeitungs Historie mit schnellem Zurückgreifen",
              "icon": "rewind",
              "description": "Bietet einen kompletten Kontrollpfad, der Wiederherstellung an jedem Punkt ermöglicht. Differenzen im Dokument ermöglichen einen Überblick über Veränderungen."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "**API** kann Inhalt für **Web** bereitstellen."
            },
            {
              "product": "publish",
              "description": "Inhalt in **API** kann in **Publish** bearbeitet werden."
            }
          ]
        },
        {
          "lang": "de",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "Eine Echtzeit Asset und Delivery Oberfläche, gestaltet als moderne, weltweite Content Distribution Lösung.",
          "description": [
            "**DADI CDN** ist analog zu einem traditionellen CDN (Content Distribution Network) wie [Akamai](https://www.akamai.com/) oder [Limelight](https://www.limelight.com/) zu sehen. Es ist so gestaltet, dass es die Verarbeitung und die Belastung, die mit der Bildbearbeitung und dem Asset Delivery (CSS/JS/fonts) verbunden ist, unterstützt und autonom als eine weitere Ebene über dem Kernprodukt agiert.",
            "**CDN** bietet vollen Support für Caching, Header Control, Bildbearbeitung, Bildkompression und Bildkonvertierung an. Ein authentifiziertes API erlaubt ein feinabgestimmtes Cache Control in der Form von Entwertung von Inhalten einer individuellen Datei oder auf der Basis von kollektiven Pfaden."
          ],
          "headlines": [
            "Bedienbar von **Amazon S3**, einem Remoteserver oder dem lokalen Dateisystem",
            "Dynamisches Erstellen von Bilder für **ansprechendes Design** und mobile Endgeräte",
            "Erweitertes Set an **Bildbearbeitungs**- und **Veränderungstools**",
            "Konvertierung des **Bildformats**"
          ],
          "features": [
            {
              "title": "Herunterstutzen auf den Gegenstand",
              "icon": "picture",
              "description": "Lassen sie CDN den Fokus ihres Bildes festlegen und liefern sie ein Bild, das nur die essentiellen Sachen beinhaltet, gestutzt auf ihre Spezifizierungen."
            },
            {
              "title": "Vereinfachter Medienspeicher",
              "icon": "database",
              "description": "Es ist nicht nötig, vielfache Größen von jedem Bild aufzubewahren, das in einen Artikel hochgeladen wird - CDN erstellt neue Variationen von einem einzigen Masterbild."
            },
            {
              "title": "Ein CDN für alle Asset Typen",
              "icon": "layers",
              "description": "SSpeichern und stellen sie Font Dateien zur Verfügung und setzen sie all ihre CSS und JavaScript Ressourcen für Delivery herunter."
            },
            {
              "title": "Intelligente Delivery",
              "icon": "activity",
              "description": "Lassen sie CDN über die Umwandlungen basierend auf Endgerät, Netzwerk, Standort und Sprache entscheiden."
            },
            {
              "title": "Delivery Recipe",
              "icon": "id",
              "description": "Speichern sie häufig genutzte Bildbearbeitungsparameter als 'delivery recipe'."
            },
            {
              "title": "Cachebeschränkungen für schnellere Delivery",
              "icon": "bolt",
              "description": "Konvertierte Bilder können mit Hilfe eines Redis Servers oder dem lokalen Dateisystem gecached werden um schnellere Delivery für spätere Anfragen zu ermöglichen."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "**Publish** verwaltet Inhalte, die in **API** gespeichert sind"
            },
            {
              "product": "cdn",
              "description": "**Publish** benutzt **CDN** um Bilder zu speichern und zu bearbeiten."
            },
            {
              "product": "web",
              "description": "**Publish** kann mithilfe von **Web** ein Frontend bedienen."
            }
          ]
        },
        {
          "lang": "de",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "Eine schemalose Vorlagenebene, die entweder als Standalone Plattform betrieben werden kann oder mit API als eine allumfassende Internetanwendung.",
          "description": [
            "**DADI Web** erleichtert das Erstellen von benutzerdefinierten Internetanwendungen für Unternehmen. Einfaches Erstellen von statischen Seiten oder Verbinden von APIs um datengestütze Apps zu generieren, die die Möglichkeit bieten, die Daten zu suchen, zu nummerieren, zu sortieren und zu filtern, auf dem Server oder im Browser.",
            "**DADI Web** kann eine Vielzahl von vorgegebenen Sprachen benutzen um dabei eine einfache und doch leistungsstarke Vorlagenoberfläche zum Darstellen der Daten zu bieten. Diese beinhalten _LinkedIn’s_ [Dust](http://www.dustjs.com/), [Pug](https://pugjs.org/) oder [Handlebars](http://handlebarsjs.com/) - oder Sie können auch einfach ihre Eigene herstellen."
          ],
          "headlines": [
            "Verbindung mit **REST APIs** möglich, um datengestützte Seiten zu generieren.",
            "Suchen, Nummerieren, Sortieren und Filtern der Daten",
            "Einfaches Erstellen von **statischen Seiten**",
            "Unterstützung für **Datenbanken-backend** Sessions"
          ],
          "features": [
            {
              "title": "Flexibler template engine support",
              "icon": "chat-alt",
              "description": "Benutzen sie Webs voreingestellte Dust.js Template Engine oder schwenken sie um auf Pug.js oder Handlebar.js - sie können sogar ihre Eigene erstellen!"
            },
            {
              "title": "URL Rewriting Support",
              "icon": "duplicate",
              "description": "Beinhaltet Apache ähnliches URL Rewriting, mit kompletter Unterstützung für Umleitungen und Proxys."
            },
            {
              "title": "Events Oberfläche",
              "icon": "bolt",
              "description": "Erstellen Sie benutzerdefinierte JavaScript Events um Frage und Antwort zu modifizieren oder werden sie aktiv auf Grundlage von Daten aus einer Quelle."
            },
            {
              "title": "Daten von überall",
              "icon": "cloud",
              "description": "Sie müssen sich nicht auf die Benutzung von DADI API beschränken - Speisen sie Daten von statischen Markdown Dateien ein oder greifen sie auf Feeds von Twitter oder Wordpress zu."
            },
            {
              "title": "Vorladen von Daten",
              "icon": "fast-forward",
              "description": "Beschleunigen sie den Zugriff auf häufig angefragte Daten durch das Vorladen dieser, wenn die Anwendung hochfährt."
            },
            {
              "title": "Cachen sie Seiten für einen schnelleren Zugriff",
              "icon": "performance",
              "description": "Datencache, der entweder einen Redis Server oder das lokale Dateisystem benutzt, um schnellere Antwortzeiten zu ermöglichen. Beinhaltet den kompletten Support von Cache-Control Headers."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "**Web** kann Inhalt von **API** darstellen."
            },
            {
              "product": "cdn",
              "description": "**Web** benutzt **CDN** um Bilder darzustellen, CSS und JS."
            }
          ]
        },
        {
          "lang": "jp",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "APIファーストの開発とCOPEの原則をサポートする高性能RESTful APIレイヤー。",
          "description": [
            "DADI APIは、デジタルプラットフォームのバックボーンとしてすぐに機能する迅速なセットアップのデータレイヤーです。テンプレートレイヤーやモバイルアプリケーションに組み入れるように、あるいは他のデータ利用者とともに使用されるように設計されています。DADIテクノロジスイート内の他のアプリケーションと共に使用することもできます。",
            "ビジネス／ドメインロジック (データの作成、表示、保存、変更の方法を決定する現実世界でのビジネスルールをエンコードするプラットフォームの一部) を含めることができます。DADI APIを使用すると、立ち上がって実行する完全なデータレイヤーを数分で入手することができます。"
          ],
          "headlines": [
            "簡単にデータのフィルタリングと並べ替えを行う",
            "柔軟なデータベースのサポート",
            "自動ドキュメントのバージョン管理",
            "組み込みのoAuth2のサポート"
          ],
          "features": [
            {
              "title": "データのフィルタリングと並べ替えを簡単に行う",
              "icon": "folder-open",
              "description": "MongoDBスタイルのクエリの力を利用して、データのフィルタリングとソートを行います。"
            },
            {
              "title": "柔軟なデータベースのサポート",
              "icon": "database",
              "description": "MongoDB、CouchDB、RethinkDBを含む複数のデータベースコネクタをサポートします。"
            },
            {
              "title": "データベースの自動インデクシング",
              "icon": "list",
              "description": "下層のデータベースのインデックス作成は、コレクションに設定項目を追加するのと同じくらい簡単です。"
            },
            {
              "title": "自動的な入力値のバリデーション",
              "icon": "happy",
              "description": "入力値のバリデーションのためのコレクション内のフィールドを簡単に設定することができます。"
            },
            {
              "title": "コレクションレベルのアクセス制御",
              "icon": "locked",
              "description": "きめ細やかな認可レイヤーを使用すると、データにアクセスできるユーザーとその方法を制御することができます。"
            },
            {
              "title": "高速な取得のためのデータのキャッシュ",
              "icon": "cloud-upload",
              "description": "Redisサーバーまたはローカルファイルシステムを使用してデータをキャッシュし、応答時間を短縮します。"
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "APIはWeb用の動的コンテンツを提供できます。"
            },
            {
              "product": "publish",
              "description": "Publishは、APIのコンテンツを編集するためのインターフェイスを提供します。"
            }
          ]
        },
        {
          "lang": "jp",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "コンテンツ制作の世界へのライターの窓口。編集ワークフローを最適化するように設計された柔軟なインターフェイス。",
          "description": [
            "DADIのPublishは、要件に合わせた柔軟なインターフェイスを用いて編集ワークフローを最適化するために開発されたものです。すなわち、コンテンツの管理に時間を費やすよりも多くの時間をコンテンツの作成に費やすことができます。COPE (Create Once Publish Everywhere) の原則をサポートするために構築されています。",
            "ジャーナリストと編集者は、複数のプロダクトにまたがる出力を1か所でシームレスに管理できます。エンジニアは複雑なコンテンツコレクションでも軽快に作業できます。Publishは現在DADIのAPIで動作しますが、開発ロードマップでは、間もなく様々なデータストアの使用ができるようになります。"
          ],
          "headlines": [
            "拡張可能なカスタムフィールド",
            "複数のAPIにわたるドキュメントを管理する",
            "シンプルなドラッグアンドドロップツールを使用した 直感的なブラウザ内エディタ",
            "ビッグデータ操作、分析などなどを管理する バックグラウンドタスク"
          ],
          "features": [
            {
              "title": "集中メディア管理",
              "icon": "picture",
              "description": "単一のコンテンツストアから一連のデジタルプロダクトを動かします。エンジニアだけでなく編集者の時間と労力も節約します。"
            },
            {
              "title": "記事公開のスケジューリング",
              "icon": "time",
              "description": "就業日に限らずコンテンツに合った時間に自動公開するコンテンツを事前にロードします。また、内部レビュー用の下書きを作成します。"
            },
            {
              "title": "30秒でセットアップと接続",
              "icon": "database",
              "description": "DADIのAPIの完璧なパートナーです。数週間から数ヶ月ではなく数日から数週間で立ち上げて稼働できます。すぐに他のデータストアとも動作するようになります。"
            },
            {
              "title": "カスタムユーザーパーミッション",
              "icon": "locked",
              "description": "大規模なチームのための強化された機能です。システムの適切な部分に適切な手を入れるようにします。編集ワークフローをサポートするために拡張しました。"
            },
            {
              "title": "共同作業による文書編集",
              "icon": "user-new",
              "description": "同僚が共有記事のどこにいるのかを確認して、踏んづけてしまうことを避けます。コンテンツを更新するためにシームレスに共同作業します。"
            },
            {
              "title": "迅速な取り消しのできる改訂履歴",
              "icon": "rewind",
              "description": "任意の時点にリストアできる完全な監査証跡を提供します。ドキュメントの差分は変更の概要を提供します。"
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "APIはWeb用のコンテンツを提供できます。"
            },
            {
              "product": "publish",
              "description": "PublishでAPIのコンテンツを編集することができます。"
            }
          ]
        },
        {
          "lang": "jp",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "最新のグローバルコンテンツ配信ソリューションとして設計された、ジャストインタイムでのアセット操作および配信レイヤー",
          "description": [
            "DADIのCDNはAkamaiやLimelightなどの従来のCDN (Content Distribution Network) に類似しています。画像操作とアセット配信 (CSS/JS/fonts) の処理と配信負荷を負担するように設計されています。そして、コアプロダクト上のレイヤーとして自律的に動作します。",
            "CDNは、キャッシング、ヘッダー制御、画像操作、画像フォーマット変換をフルサポートします。認証されたAPIにより、個々のファイルあるいはその集合のパス単位に、コンテンツの無効化という形態で、きめ細かなキャッシュ制御が可能になります。"
          ],
          "headlines": [
            "Amazon S3、リモートサーバーまたはローカルファイルシステムから供給されます。",
            "レスポンシブデザインとモバイルデバイスのための画像を動的に生成します。",
            "Extensive set of image enhancement and transformation tools",
            "Image format conversion"
          ],
          "features": [
            {
              "title": "主題に基づいた切り抜き",
              "icon": "picture",
              "description": "CDNにイメージの焦点を決定させて、仕様に合わせて切り抜いた本質だけを含むイメージを提供させましょう。"
            },
            {
              "title": "簡略化されたメディアストレージ",
              "icon": "database",
              "description": "記事にアップロードする各イメージの複数のサイズを維持する必要はありません。CDNは単一のマスターイメージから新しいバリエーションを生成します。"
            },
            {
              "title": "すべてのアセットタイプに1つのCDN",
              "icon": "layers",
              "description": "フォントファイルを保存して配信し、配信用にCSSとJavaScriptのすべてのアセットを縮小します。"
            },
            {
              "title": "インテリジェントな配信",
              "icon": "activity",
              "description": "CDNにデバイス、ネットワーク、場所、あるいは言語に基づく最適な変換を選択させるようにしましょう。"
            },
            {
              "title": "配信レシピ",
              "icon": "id",
              "description": "頻繁に使用される画像操作パラメータを「配送レシピ」として保存しましょう。"
            },
            {
              "title": "高速な配信のために切り取りをキャッシュする",
              "icon": "bolt",
              "description": "変換されたイメージは、Redisサーバーまたはローカルファイルシステムを使用してキャッシュすることができます。後続の要求に対してより高速な配信を提供します。"
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "PublishはAPIで保存されたコンテンツを管理します。"
            },
            {
              "product": "cdn",
              "description": "Publishは画像の保存と操作にCDNを使用します。"
            },
            {
              "product": "web",
              "description": "Publishはフロントエンドの提供にWebを使用することができます。"
            }
          ]
        },
        {
          "lang": "jp",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "スタンドアロンのプラットフォームとして、あるいはAPIを使用したフルスタックのWebアプリケーションとして動作するスキーマレスのテンプレートレイヤー。",
          "description": [
            "DADI Webを使用すると、エンタープライズグレードのカスタムWebアプリケーションを簡単に構築することができます。静的なページを簡単に作成したり、サーバー上であるはブラウザ上で、APIに接続してデータ駆動型のアプリケーションを生成し、データの検索、ページ付け、並べ替え、フィルタリングを行ったりすることができます。",
            "DADI Webは、さまざまなテンプレート言語を使用することができます。データを表示するためのシンプルで強力なテンプレートレイヤーを提供します。これらにはLinkedInのDustやPug、Handlebarsなどがあります。ご自身のものを作ることも簡単です。"
          ],
          "headlines": [
            "REST APIに接続してデータ駆動のページを生成します。",
            "データの検索、ページ分け、ソート、フィルターを行います。",
            "静的ページも容易に作成できます。",
            "データベース支援のセッションをサポートします。"
          ],
          "features": [
            {
              "title": "柔軟なテンプレートエンジンのサポート",
              "icon": "chat-alt",
              "description": "WebのデフォルトのDust.jsテンプレートエンジンを使用するか、Pug.jsまたはHandlebars.jsに取り替えます。ご自身のものを作っても構いません！"
            },
            {
              "title": "URL書き換えのサポート",
              "icon": "duplicate",
              "description": "リダイレクトとプロキシーを完全にサポートした、ApacheのようなURL書き換えを含みます。"
            },
            {
              "title": "イベントレイヤー",
              "icon": "bolt",
              "description": "カスタムJavaScriptイベントを作成してリクエストとレスポンスを変更します。あるいは、ソースからロードされたデータに基づいてアクションを実行します。"
            },
            {
              "title": "どこからのデータでも",
              "icon": "cloud",
              "description": "DADI APIを使用しなければならないわけではありません。静的なMarkdownファイルからデータを配信したり、TwitterやWordpressからフィードを取得したりすることができます。"
            },
            {
              "title": "データの事前ロード",
              "icon": "fast-forward",
              "description": "アプリケーションの起動時にプリロードすることで、よく要求されるデータへのアクセスを高速化します。"
            },
            {
              "title": "取得の高速化のためにページをキャッシュする",
              "icon": "performance",
              "description": "Redisサーバーまたはローカルファイルシステムを使用してデータをキャッシュし、ユーザーへの応答時間を短縮します。Cache-Controlヘッダーの完全なサポートを含みます。"
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "WebはAPIのコンテンツを表示できます。"
            },
            {
              "product": "cdn",
              "description": "WebはCDNを使用して画像、CSS、JSを提供します。"
            }
          ]
        },
        {
          "lang": "fr",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "Une couche API RESTful à haute performance conçue pour soutenir le développement d'API-first et les principes de COPE.",
          "description": [
            "L'API de DADI est une couche de données de configuration rapide, prête à être l'épine dorsale de votre plate-forme numérique. Elle est conçue pour être branchée dans une couche de modèle, une application mobile ou pour être utilisée avec tout autre consommateur de données - et peut être utilisée aux côtés d'autres applications de l'ensemble technologique DADI.",
            "Elle peut contenir votre logique métier/domaine (la partie d'une plate-forme qui encode les règles commerciales du monde réel qui déterminent comment les données sont créées, affichées, stockées et modifiées). L'API de DADI vous permet de mettre en œuvre une couche de données complète en quelques minutes."
          ],
          "headlines": [
            "Filtrez et triez vos données avec facilité",
            "Prise en charge de la base de données flexible",
            "Version automatique du document",
            "Construite pour soutenir oAuth2"
          ],
          "features": [
            {
              "title": "Filtrez et triez vos données avec facilité",
              "icon": "folder-open",
              "description": "Profitez de la puissance des recherches de type MongoDB pour filtrer et trier vos données."
            },
            {
              "title": "Prise en charge de la base de données flexible",
              "icon": "database",
              "description": "Prise en charge de plusieurs connecteurs de base de données incluant MongoDB, CouchDB et RethinkDB."
            },
            {
              "title": "Indexation automatique des bases de données",
              "icon": "list",
              "description": "L'indexation de votre base de données sous-jacente est aussi simple qu'ajouter des éléments de configuration aux collections."
            },
            {
              "title": "Validation d'entrée automatique",
              "icon": "happy",
              "description": "Configurez facilement les champs dans les collections pour la validation des entrées."
            },
            {
              "title": "Contrôle d'accès au niveau de la collecte",
              "icon": "locked",
              "description": "Avec une couche d'autorisation à grain fin, contrôlez qui peut accéder aux données et comment."
            },
            {
              "title": "Données de cache pour une récupération plus rapide",
              "icon": "cloud-upload",
              "description": "Données de cache à l'aide d'un serveur Redis ou du système de fichiers local, offrant des temps de réponse plus rapides."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "L'API peut fournir un contenu dynamique pour le Web."
            },
            {
              "product": "publish",
              "description": "Publish fournit une interface pour éditer le contenu dans l'API."
            }
          ]
        },
        {
          "lang": "fr",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "Une fenêtre d'écrivains vers le monde de la création de contenu. Des interfaces flexibles conçues pour optimiser le flux de travail éditorial.",
          "description": [
            "DADI Publish est développé pour optimiser le flux de travail éditorial avec des interfaces flexibles qui s'adaptent à vos besoins, ce qui signifie que plus de temps peut être consacré à faire du contenu qu'à perdre le temps à le gérer. Il est conçu pour prendre en charge les principes de COPE (Create Once Publish Everywhere).",
            "Les journalistes et les éditeurs peuvent gérer de manière facie la sortie de plusieurs produits à partir d'un endroit, tandis que les ingénieurs peuvent faire du travail léger même des collections de contenu complexes. Publish fonctionne actuellement avec l'API de DADI, mais notre feuille de route de développement permettra bientôt l'utilisation avec une variété de magasins de données."
          ],
          "headlines": [
            "Des champs personnalisés extensibles",
            "Gérez des documents dans plusieurs API",
            "Éditeur dans le navigateur intuitif avec l'outil simple de glisser-déposer",
            "Des tâches d'arrière-plan pour gérer les opérations de mégadonnées, les analyses et bien plus encore"
          ],
          "features": [
            {
              "title": "Gestion centralisée des médias",
              "icon": "picture",
              "description": "Faites fonctionner une suite de produits numériques à partir d'un seul magasin de contenu. Économise du temps et des efforts pour les ingénieurs et les éditeurs."
            },
            {
              "title": "Calendrier de publication des articles",
              "icon": "time",
              "description": "Préchargez le contenu pour la publication automatique au moment qui convient au contenu, pas à votre journée de travail. Créez également des projets pour l'examen interne."
            },
            {
              "title": "Configurez et connectez-vous en 30 secondes",
              "icon": "database",
              "description": "Le partenaire idéal pour l'API de DADI, pour que vous soyez prêt et fonctionnel en des jours et des semaines, pas en des semaines et des mois. Fonctionnera bientôt avec d'autres magasins de données."
            },
            {
              "title": "Autorisations d'utilisateur personnalisées",
              "icon": "locked",
              "description": "Fonctionnalités améliorées pour les grandes équipes - garder les bonnes mains sur les bonnes parties du système. Prolonge le flux de travail éditorial."
            },
            {
              "title": "Édition de documents collaborative",
              "icon": "user-new",
              "description": "Voyez où sont les collègues dans des articles partagés et évitez d'envahir leur territoire - travaillez ensemble de manière transparente pour mettre à jour le contenu."
            },
            {
              "title": "Historique de commentaires avec retour rapide",
              "icon": "rewind",
              "description": "Fournit une piste d'audit complète vous permettant de restaurer à tout moment. Les écarts de documents donnent un aperçu des changements."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "L'API peut fournir du contenu pour le Web."
            },
            {
              "product": "publish",
              "description": "Le contenu dans l'API peut être édité dans Publish."
            }
          ]
        },
        {
          "lang": "fr",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "Une solution de manipulation et de distribution d'actifs juste à temps conçue comme une solution de distribution de contenu mondiale et moderne.",
          "description": [
            "Le CDN de DADI est analogue à un CDN (réseau de distribution de contenu) traditionnel tel qu'Akamai et Limelight. Il est conçu pour asummer le traitement et la charge de livraison associés à la manipulation d'images et à la livraison d'actifs (CSS/JS/polices) et agit de manière autonome comme couche en plus de votre produit de base.",
            "CDN prend pleinement en charge la mise en cache, le contrôle d'en-tête, la manipulation d'images, la compression d'images et la conversion du format d'image. Une API authentifiée permet un contrôle de cache à grain fin sous la forme d'une invalidation de contenu sur un fichier individuel ou une base de cheminement collectif."
          ],
          "headlines": [
            "Servez depuis Amazon S3, depuis un serveur distant ou depuis le système de fichiers local",
            "Générez dynamiquement des images pour la conception réactive et les appareils mobiles",
            "Ensemble étendu d'outils d'amélioration et de transformation d'images",
            "Conversion du format d'image "
          ],
          "features": [
            {
              "title": "Culture basée sur des sujets",
              "icon": "picture",
              "description": "Laissez CDN décider le point focal de l'image et fournir une image contenant uniquement les éléments essentiels, découpés selon vos spécifications."
            },
            {
              "title": "Stockage multimédia simplifié",
              "icon": "database",
              "description": "Il n'est pas nécessaire de maintenir plusieurs tailles de chaque image que vous téléchargez dans un article - CDN génère de nouvelles variantes à partir d'une seule image maître."
            },
            {
              "title": "Un CDN pour tous les types d'actifs",
              "icon": "layers",
              "description": "Stockez et fournissez des fichiers de police et minimisez tous vos actifs CSS et JavaScript pour la livraison."
            },
            {
              "title": "Livraison intelligente",
              "icon": "activity",
              "description": "Laissez CDN choisir les meilleures transformations en fonction de l'appareil, du réseau, de l'emplacement ou de la langue."
            },
            {
              "title": "Recettes de livraison",
              "icon": "id",
              "description": "Conservez les paramètres de manipulation des images fréquemment utilisés comme une « recette de livraison »."
            },
            {
              "title": "Le cache est découpé pour une livraison plus rapide",
              "icon": "bolt",
              "description": "Les images converties peuvent être mises en cache à l'aide d'un serveur Redis ou d'un système de fichiers local, fournissant une livraison plus rapide sur les demandes ultérieures."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Publish gère le contenu stocké dans l'API."
            },
            {
              "product": "cdn",
              "description": "Publish utilise CDN pour stocker et manipuler des images."
            },
            {
              "product": "web",
              "description": "Publish peut utiliser le Web pour servir un front-end."
            }
          ]
        },
        {
          "lang": "fr",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "Une couche de modélisation sans schéma qui peut fonctionner comme une plate-forme autonome ou avec API en tant qu'application Web full stack.",
          "description": [
            "DADI Web facilite la création d'applications Web commerciales personnalisées. Créez facilement des pages statiques ou connectez-vous à des API pour générer des applications basées sur les données, ce qui vous permet de rechercher, de paginer, de trier et de filtrer vos données, sur le serveur ou dans le navigateur.",
            "DADI Web peut utiliser une variété de langages de modèles, fournissant une couche de modèle simple mais puissante pour afficher vos données. Ceux-ci incluent Dust, Pug ou Handlebars de LinkedIn - ou vous pouvez facilement créer le vôtre."
          ],
          "headlines": [
            "Connectez-vous avec les API REST pour générer des pages guidées par les données",
            "Recherchez, paginez, triez et filtrez vos données",
            "Créez facilement des pages statiques",
            "Prise en charge des sessions soutenues par la base de données"
          ],
          "features": [
            {
              "title": "Prise en charge du moteur de modèle flexible",
              "icon": "chat-alt",
              "description": "Utilisez le moteur de modèle Dust.js par défaut du Web ou remplacez-en un par Pug.js ou Handlebars.js - créez même le vôtre !"
            },
            {
              "title": "Compatibilité avec la réécriture d'URL",
              "icon": "duplicate",
              "description": "Comprend une réécriture d'URL similaire à Apache, avec une compatibilité complète avec les redirections et la mise en page."
            },
            {
              "title": "Couche des événements",
              "icon": "bolt",
              "description": "Créez des événements JavaScript personnalisés pour modifier la demande et la réponse, ou prenez des mesures en fonction des données chargées à partir d'une source"
            },
            {
              "title": "Données provenant de n'importe où",
              "icon": "cloud",
              "description": "Vous n'êtes pas limité à l'utilisation de l'API de DADI - utilisez les données des fichiers Markdown statiques ou récupérez les flux de Twitter et de Wordpress."
            },
            {
              "title": "Pré-chargez les données",
              "icon": "fast-forward",
              "description": "Accélérez l'accès aux données communément requises en les préchargeant lorsque l'application démarre."
            },
            {
              "title": "Pages de cache pour une récupération plus rapide",
              "icon": "performance",
              "description": "Données de cache à l'aide d'un serveur Redis ou du système de fichiers local, offrant des temps de réponse plus rapides aux utilisateurs. Comprend une prise en charge complète pour les en-têtes Cache-Contrôle."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Le Web peut afficher le contenu de l'API."
            },
            {
              "product": "cdn",
              "description": "Le Web utilise CDN pour servir des images, CSS et JS."
            }
          ]
        },
        {
          "lang": "es",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "Una capa de API de alto rendimiento tranquila diseñada para apoyar el desarrollo de API-first y los principios de COPE.",
          "description": [
            "La API de DADI es una capa de datos de configuración rápida lista para actuar como columna vertebral de su plataforma digital y está diseñada para ser conectada a una capa de plantillas, una aplicación móvil o para ser utilizada con cualquier otro consumidor de datos, y se puede usar junto con otras aplicaciones de la serie tecnológica DADI.",
            "Puede contener la lógica de su negocio/dominio (la parte de una plataforma que codifica las reglas de negocio del mundo real que determinan cómo se crean, muestran, almacenan y cambian los datos). La API de DADI le permite tener una capa de datos completa en funcionamiento en cuestión de minutos."
          ],
          "headlines": [
            "Filtre y clasifique sus datos con facilidad",
            "Soporte flexible de bases de datos",
            "Versión automática de documentos",
            "Construido en compatibilidad con oAuth2"
          ],
          "features": [
            {
              "title": "Filtre y ordene sus datos con facilidad",
              "icon": "folder-open",
              "description": "Aproveche la potencia de la consulta estilo MongoDB para filtrar y clasificar sus datos."
            },
            {
              "title": "Soporte flexible de bases de datos",
              "icon": "database",
              "description": "Compatibilidad con múltiples conectores de bases de datos como MongoDB, CouchDB y RethinkDB."
            },
            {
              "title": "Indexación automática de bases de datos",
              "icon": "list",
              "description": "La indexación de su base de datos subyacente es tan simple como añadir elementos de configuración a las colecciones."
            },
            {
              "title": "Validación automática de entrada",
              "icon": "happy",
              "description": "Configure fácilmente los campos dentro de las colecciones para la validación de entrada."
            },
            {
              "title": "Control de acceso a nivel de colección",
              "icon": "locked",
              "description": "Con una capa de autorización de grano fino, controle quién puede acceder a los datos y cómo."
            },
            {
              "title": "Datos de caché para una recuperación más rápida",
              "icon": "cloud-upload",
              "description": "Datos de caché que utilizan un servidor Redis o el sistema de archivos local, proporcionando tiempos de respuesta más rápidos."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "La API puede proporcionar contenido dinámico para la web."
            },
            {
              "product": "publish",
              "description": "Publish proporciona una interfaz para editar contenido en la API."
            }
          ]
        },
        {
          "lang": "es",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "La ventana de un escritor al mundo de la creación de contenidos. Interfaces flexibles diseñadas para optimizar el flujo de trabajo editorial.",
          "description": [
            "DADI Publish está desarrollado para optimizar el flujo de trabajo editorial con interfaces flexibles que se adaptan a sus necesidades, lo que significa que se puede dedicar más tiempo a crear contenido que perder tiempo en gestionarlo.",
            "Los periodistas y editores pueden gestionar de forma transparente la producción a través de múltiples productos desde un solo lugar, mientras que los ingenieros pueden hacer un trabajo ligero incluso de colecciones de contenido complejas. Publish actualmente funciona con DADI API, pero nuestra hoja de ruta de desarrollo pronto permitirá el uso con una variedad de almacenes de datos."
          ],
          "headlines": [
            "Campos personalizados ampliables",
            "Administre documentos entre varias API",
            "Editor en el navegador intuitivo con la simple herramienta de arrastrar y soltar",
            "Tareas de fondo para administrar grandes operaciones de datos, análisis y mucho más"
          ],
          "features": [
            {
              "title": "Gestión de medios centralizada",
              "icon": "picture",
              "description": "Permite el funcionamiento de una serie de productos digitales de una sola tienda de contenido. Ahorra tiempo y esfuerzo tanto para ingenieros como para editores."
            },
            {
              "title": "Programación de la publicación del artículo",
              "icon": "time",
              "description": "Precargue el contenido para la publicación automática en un momento que se adapte al contenido, no a su día de trabajo. También cree borradores para revisión interna."
            },
            {
              "title": "Configuración y conexión en 30 segundos",
              "icon": "database",
              "description": "El compañero perfecto para la API de DADI, para que esté operativo en días y semanas, no semanas y meses. Trabaje pronto con otros almacenes de datos."
            },
            {
              "title": "Permisos de usuario personalizados",
              "icon": "locked",
              "description": "Funciones mejoradas para equipos grandes: manteniendo las manos adecuadas en las partes adecuadas del sistema. Se amplía para apoyar el flujo de trabajo editorial."
            },
            {
              "title": "Edición de documentos colaborativos",
              "icon": "user-new",
              "description": "Vea dónde están sus colegas en los artículos compartidos y evite pasarles por encima: trabajen juntos sin problemas para actualizar el contenido."
            },
            {
              "title": "Historial de revisiones con el inversor rápido",
              "icon": "rewind",
              "description": "Proporciona un registro de auditoría completo que le permite restaurar a cualquier punto en el tiempo. Los diferenciales de documentos proporcionan una visión general de los cambios."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API puede proporcionar contenido para la Web."
            },
            {
              "product": "publish",
              "description": "El contenido de la API se puede editar en Publish."
            }
          ]
        },
        {
          "lang": "es",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "Una capa de manipulación y entrega de activos justo a tiempo diseñada como una solución moderna de distribución de contenido global.",
          "description": [
            "La CDN de DADI es análoga a una CDN (Red de Distribución de Contenidos) tradicional como Akamai y Limelight, está diseñada para soportar la carga de procesamiento y entrega asociada a la manipulación de imágenes y entrega de activos (CSS/JS/fuente) y actúa de forma autónoma como capa en la parte superior de su producto principal.",
            "CDN tiene compatibilidad completa con el almacenamiento en caché, control de encabezado, manipulación de imágenes, compresión de imágenes y conversión de formatos de imagen. Una API autenticada permite un control de caché de grano fino en forma de invalidación de contenido en un archivo individual o una base de ruta colectiva. La web de DADI puede utilizar diversos lenguajes de plantilla, proporcionando una capa de plantilla simple pero potente para mostrar sus datos. Estos incluyen Dust, Pug o Handlebars de LinkedIn, o puede hacer fácilmente los suyos propios."
          ],
          "headlines": [
            "Sirve desde Amazon S3, un servidor remoto o el sistema de archivos local",
            "Genera dinámicamente imágenes para diseño sensible y dispositivos móviles",
            "Amplio conjunto de herramientas de mejora y transformación de imágenes",
            "Conversión de formato de imagen"
          ],
          "features": [
            {
              "title": "Recortar en función del tema",
              "icon": "picture",
              "description": "Deje que CDN decida el punto focal de la imagen y entregue una imagen que contenga solo lo esencial, recortada según sus especificaciones."
            },
            {
              "title": "Almacenamiento multimedia simplificado",
              "icon": "database",
              "description": "No es necesario mantener múltiples tamaños de cada imagen que suba a un artículo: CDN genera nuevas variantes de una sola imagen maestra."
            },
            {
              "title": "Una CDN para todos los tipos de activos",
              "icon": "layers",
              "description": "Almacene y entregue archivos de fuentes y minimice todos sus activos CSS y JavaScript para su entrega."
            },
            {
              "title": "Entrega inteligente",
              "icon": "activity",
              "description": "Permita que CDN elija las mejores transformaciones basadas en el dispositivo, la red, la ubicación o el idioma."
            },
            {
              "title": "Recetas de entrega",
              "icon": "id",
              "description": "Almacene los parámetros de manipulación de imágenes utilizados con frecuencia como una \"receta de entrega\"."
            },
            {
              "title": "La caché se recorta para una entrega más rápida",
              "icon": "bolt",
              "description": "Las imágenes convertidas se pueden almacenar en caché utilizando un servidor Redis o el sistema de archivos local, proporcionando una entrega más rápida en las solicitudes posteriores."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Publish gestiona el contenido almacenado en la API."
            },
            {
              "product": "cdn",
              "description": "Publish utiliza CDN para almacenar y manipular imágenes."
            },
            {
              "product": "web",
              "description": "Publish puede utilizar la web para atender a un front-end."
            }
          ]
        },
        {
          "lang": "es",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "Una capa de plantilla sin esquema que puede funcionar como una plataforma independiente o con API como una aplicación web full stack.",
          "description": [
            "La web de DADI facilita la creación de aplicaciones web personalizadas de calidad empresarial Cree fácilmente páginas estáticas o conecte con la API para generar aplicaciones orientadas a datos que le permitan buscar, paginar, ordenar y filtrar sus datos en el servidor o en el navegador.",
            "La web de DADI puede utilizar diversos lenguajes de plantilla, proporcionando una capa de plantilla simple pero potente para mostrar sus datos. Éstos incluyen Dust, Pug o Handlebars de LinkedIn; o puede hacer fácilmente los suyos propios."
          ],
          "headlines": [
            "Conecte con las API REST para generar páginas basadas en datos",
            "Busque, pagine, clasifique y filtre sus datos",
            "Cree fácilmente páginas estáticas",
            "Compatibilidad con sesiones respaldadas por bases de datos"
          ],
          "features": [
            {
              "title": "Compatibilidad con motor de plantilla flexible",
              "icon": "chat-alt",
              "description": "Utilice el motor predeterminado de la plantilla de Dust.js de la web o intercambie uno por Pug.js o Handlebars.js: ¡incluso diseñe los suyos propios!"
            },
            {
              "title": "Soporte de reescritura de URL",
              "icon": "duplicate",
              "description": "Incluye reescritura de URL similar a Apache, con soporte completo para redirecciones y proxy."
            },
            {
              "title": "Capa de eventos",
              "icon": "bolt",
              "description": "Cree eventos de JavaScript personalizados para modificar la solicitud y la respuesta, o tome medidas basadas en datos cargados desde una fuente."
            },
            {
              "title": "Datos desde cualquier lugar",
              "icon": "cloud",
              "description": "No está limitado a usar datos de la API de DADI: sírvase de archivos de Markdown estáticos o recupere canales de Twitter y Wordpress."
            },
            {
              "title": "Datos de precarga",
              "icon": "fast-forward",
              "description": "Acelere el acceso a los datos comúnmente requeridos precargando cuando la aplicación se inicie."
            },
            {
              "title": "Páginas de caché para una recuperación más rápida",
              "icon": "performance",
              "description": "Datos de caché que utilizan un servidor Redis o el sistema de archivos local, proporcionando tiempos de respuesta más rápidos a los usuarios. Incluye compatibilidad completa con los encabezados de control de caché."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "La web puede mostrar contenido de la API."
            },
            {
              "product": "cdn",
              "description": "La web utiliza CDN para atender las imágenes, CSS y JS."
            }
          ]
        },
        {
          "lang": "ru",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "Высокопроизводительный REST-слой API поддерживает разработку по принципу API-first и соответствует принципам COPE.",
          "description": [
            "DADI API — это быстро настраиваемый слой данных, готовый к использованию в качестве основы вашей цифровой платформы. Он разработан для подключения к шаблонному слою, мобильному приложению или для использования с любым другим потребителем данных. Кроме того, его можно использовать совместно с другими приложениями из набора технологий DADI.",
            "Он может содержать бизнес-логику/логику предметной области (часть платформы, в которой содержится код с бизнес-правилами реального мира, которые определяют, каким образом данные создаются, отображаются, хранятся и изменяются). DADI API позволяет вам получить готовый полный уровень данных в считанные минуты."
          ],
          "headlines": [
            "С легкостью фильтруйте и сортируйте ваши данные",
            "Гибкая поддержка баз данных",
            "Автоматическое управление версиями документов",
            "Встроенная поддержка oAuth2"
          ],
          "features": [
            {
              "title": "С легкостью фильтруйте и сортируйте ваши данные",
              "icon": "folder-open",
              "description": "Используйте возможности запросов в стиле MongoDB для фильтрации и сортировки ваших данных."
            },
            {
              "title": "Гибкая поддержка баз данных",
              "icon": "database",
              "description": "Поддержка нескольких соединителей баз данных, включая MongoDB, CouchDB и RethinkDB."
            },
            {
              "title": "Автоматическое индексирование баз данных",
              "icon": "list",
              "description": "Индексирование вашей основной базы данных так же просто осуществить, как добавить элементы конфигурации в коллекцию."
            },
            {
              "title": "Автоматическая проверка ввода",
              "icon": "happy",
              "description": "С легкостью настраивайте поля в коллекциях для проверки ввода."
            },
            {
              "title": "Контроль доступа на уровне коллекций",
              "icon": "locked",
              "description": "Контролируйте, кто и как может получать доступ к данным, с помощью мелкоструктурного слоя авторизации."
            },
            {
              "title": "Кэшируйте данные для быстрого извлечения",
              "icon": "cloud-upload",
              "description": "Кэшируйте данные с использованием сервера Redis или локальной файловой системы для обеспечения более быстрого отклика."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API может предоставлять динамический контент для Web."
            },
            {
              "product": "publish",
              "description": "Publish предоставляет интерфейс для редактирования контента в API."
            }
          ]
        },
        {
          "lang": "ru",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "Окно писателя в мир создания контента. Гибкие интерфейсы, разработанные для оптимизации рабочих процессов редактирования.",
          "description": [
            "DADI Publish разработан для оптимизации рабочих процессов редактирования с помощью гибких интерфейсов, которые адаптируются к вашим требованиям, что позволяет проводить больше времени, занимаясь созданием контента, а не тратить время на управление им. Создан с поддержкой принципов COPE (\"Создайте Однажды и Публикуйте Везде\" — с англ. Create Once Publish Everywhere).",
            "Журналисты и редакторы могут беспрепятственно управлять текстами для нескольких продуктов в одном месте, в то время как инженеры могут облегчить даже работу над сложными коллекциями контента. На данный момент Publish работает с DADI API, но наша технологическая карта скоро сделает возможным использование с различными хранилищами данных."
          ],
          "headlines": [
            "Расширяемые настраиваемые поля",
            "Управление документами в разных API",
            "Интуитивный встроенный в браузер редактор с простым инструментом перетаскивания",
            "Фоновые задачи для управления операциями с большими данными, аналитикой и многое другое"
          ],
          "features": [
            {
              "title": "Централизованное управление мультимедиа",
              "icon": "picture",
              "description": "Обеспечивайте работу нескольких цифровых продуктов из единого хранилища контента. Экономия времени и усилий как инженеров, так и редакторов."
            },
            {
              "title": "Планирование публикации статей",
              "icon": "time",
              "description": "Загружайте контент предварительно для автоматической публикации в то время, которое подходит данному контенту, а не вашему рабочему дню. Кроме того, создавайте проекты для внутренней проверки."
            },
            {
              "title": "Настройка и подключение за 30 секунд",
              "icon": "database",
              "description": "Идеальный партнер для DADI API, благодаря которому вы можете запустить свой продукт не за недели и месяцы, а за дни и недели. Вскоре будет работать и с другими хранилищами данных."
            },
            {
              "title": "Индивидуальные разрешения пользователя",
              "icon": "locked",
              "description": "Расширенные возможности для больших команд — предоставляйте определенным людям доступ к определенным частям системы. Расширяется до поддержки рабочих процессов редактирования."
            },
            {
              "title": "Совместное редактирование документов",
              "icon": "user-new",
              "description": "Узнавайте, над какой частью общей статьи работают коллеги, не задавая навязчивых вопросов — беспрепятственно работайте вместе над обновлением контента."
            },
            {
              "title": "История изменений с быстрым возвратом",
              "icon": "rewind",
              "description": "Предоставляет доступ к полному контрольному журналу, позволяя вам откатывать изменения до любого момента. Данные о различиях в документах позволяют просмотреть изменения."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API может предоставлять контент для Web."
            },
            {
              "product": "publish",
              "description": "Контент в API можно редактировать в Publish."
            }
          ]
        },
        {
          "lang": "ru",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "Своевременный слой для передачи и управления ресурсами, разработанный в форме современного глобального решения для распределения контента.",
          "description": [
            "DADI CDN аналогична таким традиционным CDN (\"Сеть Доставки Контента\" — с англ. Content Distribution Network), как Akamai и Limelight. Она предназначена для выполнения функции обработки и передачи в процессах преобразования изображений и передачи ресурсов (CSS/JS/шрифты). Кроме того, она работает автономно в качестве слоя поверх вашего основного продукта.",
            "CDN полностью поддерживает кэширование, управление заголовками, обработку и сжатие изображений, а также конвертирование формата изображений. Аутентифицированный API позволяет осуществлять мелкоструктурное управление кэшем в виде аннулирования контента в рамках отдельного файла или коллективного пути"
          ],
          "headlines": [
            "Получайте данные из Amazon S3, удаленного сервера или локальной файловой системы",
            "Динамическое создание изображений для адаптивного дизайна и мобильных устройств",
            "Широкий набор инструментов для улучшения и преобразования изображений",
            "Конвертирование формата изображений"
          ],
          "features": [
            {
              "title": "Обрезка в зависимости от назначения",
              "icon": "picture",
              "description": "Позвольте CDN определять фокус изображения и передавать изображение, содержащее только необходимую часть и обрезанное согласно вашим спецификациям."
            },
            {
              "title": "Упрощенное хранилище мультимедиа",
              "icon": "database",
              "description": "Нет необходимости иметь несколько размеров каждого изображения для статьи — CDN генерирует новые варианты одного основного изображения."
            },
            {
              "title": "Одна CDN для всех типов ресурсов",
              "icon": "layers",
              "description": "Храните и передавайте файлы шрифтов, а также минимизируйте все ваши ресурсы CSS и JavaScript для передачи."
            },
            {
              "title": "Интеллектуальная передача",
              "icon": "activity",
              "description": "Позвольте CDN выбирать лучшие варианты преобразования в зависимости от устройства, сети, местоположения или языка."
            },
            {
              "title": "Рецепты передачи",
              "icon": "id",
              "description": "Сохраняйте часто используемые параметры обработки изображений в качестве \"рецептов передачи\"."
            },
            {
              "title": "Кэшируйте обрезанные изображения для быстрой передачи",
              "icon": "bolt",
              "description": "Конвертированные изображения могут кэшироваться с использованием сервера Redis или локальной файловой системы для обеспечения более быстрой передачи при последующих запросах."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Publish управляет контентом, хранящимся в API."
            },
            {
              "product": "cdn",
              "description": "Publish использует CDN для хранения и обработки изображений."
            },
            {
              "product": "web",
              "description": "Publish может использовать Web для поставки внешнего интерфейса."
            }
          ]
        },
        {
          "lang": "ru",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "Неструктурированный шаблонный слой, который может функционировать как автономная платформа или с API в качестве \"full stack\" веб-приложения.",
          "description": [
            "DADI Web позволяет с легкостью создавать индивидуальные веб-приложения корпоративного класса. С легкостью создавайте статические страницы или подключайтесь к API для генерирования приложений, управляемых данными, что позволит вам выполнять поиск, разбиение на страницы, сортировку и фильтрацию данных на сервере или в браузере.",
            "DADI Web может использовать различные языки шаблонов, обеспечивая простой, но мощный шаблонный слой для отображения ваших данных. Среди таких языков — Dust от LinkedIn, Pug и Handlebars, кроме того, вы можете с легкостью создать ваш собственный язык."
          ],
          "headlines": [
            "Подключайтесь к REST API для генерирования страниц, управляемых данными",
            "Выполняйте поиск, разбиение на страницы, сортировку и фильтрацию данных",
            "С легкостью создавайте статические страницы",
            "Поддержка сессий с базами данных"
          ],
          "features": [
            {
              "title": "Поддержка гибкого шаблонного движка",
              "icon": "chat-alt",
              "description": "Используйте шаблонный движок по умолчанию (Dust.js) или замените его на Pug.js или Handlebars.js, вы даже можете создать ваш собственный язык!"
            },
            {
              "title": "Поддержка переписывания URL-адресов",
              "icon": "duplicate",
              "description": "Включает переписывание URL-адресов по аналогу с Apache, с полной поддержкой перенаправления и проксирования."
            },
            {
              "title": "Слой событий",
              "icon": "bolt",
              "description": "Создавайте пользовательские события JavaScript для изменения запроса и ответа или выполняйте действия на основе данных, загруженных из источника."
            },
            {
              "title": "Данные из любого места",
              "icon": "cloud",
              "description": "Вы не ограничены использованием DADI API — используйте данные из Markdown-файлов или получайте ленты из Твиттера и Wordpress."
            },
            {
              "title": "Предварительная загрузка данных",
              "icon": "fast-forward",
              "description": "Ускорьте доступ к часто используемым данным, загружая их при запуске приложения."
            },
            {
              "title": "Кэшируйте страницы для быстрого извлечения",
              "icon": "performance",
              "description": "Кэшируйте данные с использованием сервера Redis или локальной файловой системы для обеспечения более быстрого отклика для пользователей. Включает полную поддержку заголовков Cache-Control."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Web может отображать контент из API."
            },
            {
              "product": "cdn",
              "description": "Web использует CDN поставки изображений, CSS и JS."
            }
          ]
        },
        {
          "lang": "pt",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "Uma camada API RESTful de alta performance desenhada em suporte do desenvolvimento API-first e dos princípios COPE.",
          "description": [
            "DADI API é uma camada de dados de rápida instalação preparada para funcionar como a espinha central da tua plataforma digital. É desenhada para ser ligada a uma camada de templates, uma aplicação móvel ou para ser usada com qualquer outro consumidor – e pode ser usada em conjunto com outras aplicações da suite de tecnologia DADI.",
            "Pode alojar a tua lógica de negócio/domínio (a parte de uma plataforma que representa as regras de negócio do mundo real que determinam a forma como os dados são criados, mostrados, guardados e alterados). DADI API permite-te ter uma completa camada de dados a funcionar em minutos."
          ],
          "headlines": [
            "Filtra e ordena os teus dados com facilidade",
            "Suporte para bases de dados flexível",
            "Criação de versões automática",
            "Suporte nativo para oAuth2"
          ],
          "features": [
            {
              "title": "Filtra e ordena os teus dados com facilidade",
              "icon": "folder-open",
              "description": "Tira partido do poder de pedidos ao estilo de MongoDB para filtrar e ordenar os teus dados."
            },
            {
              "title": "Suporte para bases de dados flexível",
              "icon": "database",
              "description": "Suporte para múltiplos adaptadores de bases de dados incluindo MongoDB, CouchDB e RethinkDB."
            },
            {
              "title": "Indexação de base de dados automática",
              "icon": "list",
              "description": "Indexar a tua base de dados é tão simples quanto adicionar elementos de configuração nas colecções de dados."
            },
            {
              "title": "Validação automática de input",
              "icon": "happy",
              "description": "Configura facilmente campos de colecções de dados com validação de input."
            },
            {
              "title": "Controlo de acesso ao nível das colecções de dados",
              "icon": "locked",
              "description": "Com uma camada de autorização granular, controla quem tem acesso aos dados e como."
            },
            {
              "title": "Cache dos dados para um acesso mais rápido",
              "icon": "cloud-upload",
              "description": "Faz cache dos dados usando um servidor Redis ou o sistema de ficheiros local, melhorando o tempo de resposta."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API pode fornecer conteúdos dinâmicos a Web."
            },
            {
              "product": "publish",
              "description": "Publish oferece um interface para editar conteúdos de API."
            }
          ]
        },
        {
          "lang": "pt",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "A janela de um escritor para o mundo da criação de conteúdos. Interfaces flexíveis desenhadas para optimizar o processo editorial.",
          "description": [
            "DADI Publish é desenvolvido para optimizar processos editoriais com interfaces flexíveis que se adaptam aos teus requisitos, o que se traduz em mais tempo gasto em criar conteúdos do que em geri-lo. Foi construído em suporte dos princípios de COPE (Create Once Publish Everywhere).",
            "Jornalistas e editores podem facilmente gerir o output de vários produtos num único sítio, enquanto que os engenheiros podem facilmente trabalhar com largas colecções de dados. Publish funciona com DADI API mas o nosso roadmap de desenvolvimento permitirá em breve a sua utilização com várias fontes de dados."
          ],
          "headlines": [
            "Campos feitos à medida e extensíveis",
            "Gere documentos de múltiplos APIs",
            "Editor in-browser altamente intuitivo com simples ferramentas drag and drop",
            "Operações em pano de fundo para gerir operações com grandes volumes de dados, análise de dados e muito mais"
          ],
          "features": [
            {
              "title": "Gestão central de recursos media",
              "icon": "picture",
              "description": "Alimenta um conjunto de produtos digitais através de uma única fonte de conteúdos. Poupa tempo e esforço a engenheiros e editores."
            },
            {
              "title": "Agendamento de publicação de artigos",
              "icon": "time",
              "description": "Programa conteúdos para serem publicados numa hora que se ajusta aos conteúdos, não ao teu dia de trabalho. Também cria rascunhos para revisão interna."
            },
            {
              "title": "Configura e liga em 30 segundos",
              "icon": "database",
              "description": "O parceiro perfeito para DADI API, permitindo-te estar a funcionar em dias e semanas e não semanas e meses. Em breve funcionará com outros tipos de fontes de dados."
            },
            {
              "title": "Permissões de utilizadores personalizadas",
              "icon": "locked",
              "description": "Funcionalidades melhoradas para grandes equipas – mantendo as mãos certas nas partes certas do sistema."
            },
            {
              "title": "Edição colaborativa de documentos",
              "icon": "user-new",
              "description": "Vê onde os teus colegas estão em documentos partilhados e evita calcares-lhes os calcanhares – trabalha melhor em conjunto nos conteúdos."
            },
            {
              "title": "Histórico de revisões com reversões rápidas",
              "icon": "rewind",
              "description": "Oferece um registo completo que te permite restaurar qualquer estado passado. As diferenças entre as versões dos documentos são mostradas, dando uma visão geral das alterações."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API pode gerar conteúdos para Web."
            },
            {
              "product": "publish",
              "description": "Conteúdos em API podem ser editados em Publish."
            }
          ]
        },
        {
          "lang": "pt",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "Um serviço de entrega e manipulação just-in-time de recursos, desenhada como uma solução global e moderna de distribuição de conteúdos.",
          "description": [
            "DADI CDN é análogo a um tradicional CDN (Content Distribution Network) como Akamai e Limelight. É desenhado para levar a cabo o processamento e entrega de imagens e recursos (CSS/JS/fontes) e agir autonomamente como uma camada sobre o teu produto central.",
            "CDN tem suporte para caching, controlo de cabeçalhos, manipulação de imagens, compressão de imagens e conversão entre formatos de imagens. Um API autenticado permite um controlo de cache granular na forma de invalidação de conteúdos para um ficheiro individual ou a nível colectivo."
          ],
          "headlines": [
            "Serve desde Amazon S3, um servidor remoto ou o sistema de ficheiros local",
            "Gera imagens dinamicamente para designs responsive e dispositivos móveis",
            "Conjunto extensivo de ferramentas para melhoramento e transformação de imagens",
            "Conversão de formatos de imagem"
          ],
          "features": [
            {
              "title": "Recorte baseado no ponto focal",
              "icon": "picture",
              "description": "Deixa que CDN decida o ponto focal da imagem e entrega uma imagem que contém apenas o essencial, recortada segundo as especificações necessárias."
            },
            {
              "title": "Armazenamento media simplificado",
              "icon": "database",
              "description": "Elimina a necessidade de manter vários tamanhos de cada imagem que adicionas a um artigo – CDN gera novas variações a partir de uma única imagem mestra."
            },
            {
              "title": "Um CDN para todos os tipos de recurso",
              "icon": "layers",
              "description": "Armazena e entrega ficheiros de tipo de letra e minimiza todo o teu CSS e JavaScript antes da entrega."
            },
            {
              "title": "Entrega inteligente",
              "icon": "activity",
              "description": "Deixa que CDN escolha o melhor método de transformação baseado no dispositivo, condições da rede, localização ou idioma."
            },
            {
              "title": "Receitas de Entrega",
              "icon": "id",
              "description": "Guarda parâmetros de manipulação de imagem frequentemente utilizados como 'receitas de entrega'."
            },
            {
              "title": "Faz cache dos recortes para uma entrega mais rápida",
              "icon": "bolt",
              "description": "Imagens convertidas podem ser guardadas em cache usando um servidor Redis ou o sistema de ficheiros local, permitindo uma entrega mais rápida nos pedidos seguintes."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Publish gere conteúdos armazenados em API."
            },
            {
              "product": "cdn",
              "description": "Publish usa CDN para armazenar e manipular imagens."
            },
            {
              "product": "web",
              "description": "Publish usa Web para distribuir um front-end."
            }
          ]
        },
        {
          "lang": "pt",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "Uma camada de templates sem esquemas de dados que pode operar como uma plataforma individual ou com API para formar uma aplicação web full stack.",
          "description": [
            "**DADI Web** makes it easy to build custom enterprise-grade web applications. Easily create static pages or connect to APIs to generate data-driven apps giving you the power to search, paginate, sort and filter your data, on the server or in browser.",
            "**DADI Web** can use a variety of templating languages, providing a simple yet powerful template layer for displaying your data. These include _LinkedIn’s_ [Dust](http://www.dustjs.com/), [Pug](https://pugjs.org/) or [Handlebars](http://handlebarsjs.com/) – or you can easily craft your own."
          ],
          "headlines": [
            "Liga a APIs REST para gerar páginas alimentadas por dados",
            "Procura, pagina, ordena e filtra os teus dados",
            "Cria páginas estáticas com facilidade",
            "Suporte para sessões suportadas por bases de dados"
          ],
          "features": [
            {
              "title": "Suporte flexível para motores de templates",
              "icon": "chat-alt",
              "description": "Usa o motor de templates Dust.js, padrão no Web, ou troca pelo Pug.js ou Handlebars.js – ou cria o teu próprio!"
            },
            {
              "title": "Suporte para a reescrita de URLs",
              "icon": "duplicate",
              "description": "Inclui reescrita de URLs ao estilo do Apache, com suporte para redirects e proxying."
            },
            {
              "title": "Camada de Eventos",
              "icon": "bolt",
              "description": "Cria eventos JavaScript feitos à medida para modificar o pedido e a resposta, ou para tomares decisões baseadas no que foi carregado das fontes de dados."
            },
            {
              "title": "Dados de todo o lado",
              "icon": "cloud",
              "description": "Não estás limitado a usar DADI API – serve dados de ficheiros estáticos Markdown ou carrega feeds do Twitter ou Wordpress."
            },
            {
              "title": "Carrega dados de antemão",
              "icon": "fast-forward",
              "description": "Acelera o acesso a dados frequentemente utilizados carregando-os de antemão assim que a aplicação inicia."
            },
            {
              "title": "Faz cache de páginas para rápido acesso",
              "icon": "performance",
              "description": "Faz cache de dados usando um servidor Redis ou o sistema de ficheiros local, gerando tempos de resposta mais curtos para os utilizadores. Inclui suporte para os cabeçalhos Cache-Control."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Web pode mostrar conteúdos de API."
            },
            {
              "product": "cdn",
              "description": "Web usa CDN para servir imagens, CSS e JS."
            }
          ]
        },
        {
          "lang": "zh_hant",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "為支援 API 優先開發模式和 COPE 原則所設計的高效能 RESTful API 層級架構",
          "description": [
            "DADI API 是一種可快速安裝使用、能為你的數位平台提供堅實後盾的資料層。專為連接範本層、行動應用程式或使用於其他任何資訊客戶所設計——也可與 DADI 技術套件的其他應用程式併用。",
            "可包含你的商業／網域邏輯（這是可將真實世界中決定資訊如何創造、顯示、儲存和變更的商業規則進行編碼的平台一部分）。DADI API 可讓你能在幾分鐘內就取得完整的資料層級。"
          ],
          "headlines": [
            "輕鬆過濾與排序你的資料",
            "靈活的資料庫技術支援",
            "自動檔案同步",
            "內建支援 oAuth2"
          ],
          "features": [
            {
              "title": "輕鬆過濾與排序你的資料",
              "icon": "folder-open",
              "description": "利用 MongoDB 風格的查詢功能來過濾與排序你的資料。"
            },
            {
              "title": "靈活的資料庫支援",
              "icon": "database",
              "description": "支援 MongoDB、CouchDB 和 RethinkDB 等多種資料庫連接器"
            },
            {
              "title": "自動資料庫索引",
              "icon": "list",
              "description": "為你的基礎資料庫建立索引就像新增組態元件到集合一樣簡單"
            },
            {
              "title": "自動輸入驗證",
              "icon": "happy",
              "description": "輕鬆組態集合內的欄位來進行輸入驗證"
            },
            {
              "title": "集合級存取控制",
              "icon": "locked",
              "description": "精細的授權層級能控制資料存取的對象及方式"
            },
            {
              "title": "快取資料來更快擷取",
              "icon": "cloud-upload",
              "description": "使用 Redis 伺服器或本地檔案系統來快取資料能提供更快的回應時間"
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API 可為 Web 服務提供動態內容。"
            },
            {
              "product": "publish",
              "description": "Publish 可提供介面來編輯 API 裡的內容。"
            }
          ]
        },
        {
          "lang": "zh_hant",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "為作者提供一扇內容創建世界之窗。為優化編輯工作流程設計的彈性介面",
          "description": [
            "DADI Publish 是為優化編輯工作流程和提供符合你需求的靈活介面功能來設計，代表能節省更多耗費在管理上的時間來專心創作內容。專為支援 COPE 原則（一次創建，多次出版）創建。",
            "新聞工作者和編輯可以在一個地方就能跨多項產品無縫地管理輸出，工程師也能減少對複雜內容集合的工作量。Publish 目前只能在 DADI API 下作業，但我們的開發藍圖即將很快開放支援多種資料儲存庫。"
          ],
          "headlines": [
            "可延伸的自訂欄位",
            "可跨多個 API 來管理文件",
            "配有簡易拖放工具的直覺式的瀏覽器編輯器",
            "可管理大數據作業、分析和更多功能的背景工作執行"
          ],
          "features": [
            {
              "title": "中心化媒體管理",
              "icon": "picture",
              "description": "支援透過單一內容儲存庫的數位產品組合。為工程師和編輯等有關工作者節省時間與精力"
            },
            {
              "title": "文章發表排程",
              "icon": "time",
              "description": "預載內容來自動發佈符合內容時程的作業，而不是你的工作日。另外也可為內部審查製作草稿"
            },
            {
              "title": "可在 30 秒內完成安裝連接",
              "icon": "database",
              "description": "這是 DADI API 最佳的組合，因此你無須長達數週到數月的時間就能在幾天到幾週內完成。我們也即將開放支援其他資料儲存庫"
            },
            {
              "title": "自訂使用者權限",
              "icon": "locked",
              "description": "為大型團隊設計的強化功能——將適合的人手分配在適合的系統中工作。可延伸支援編輯工作流程 "
            },
            {
              "title": "協作式文件編輯",
              "icon": "user-new",
              "description": "查看同事在共享文章的部分並避免重複他人工作——一起無縫接軌工作來更新內容"
            },
            {
              "title": "可快速還原的文件修訂歷史",
              "icon": "rewind",
              "description": "完整的系統審計追蹤讓你能回復到任何時間點。文件差異比對可讓你一覽所有變更內容"
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API 可為 Web 服務提供內容。"
            },
            {
              "product": "publish",
              "description": "API 的內容可在 Publish 進行編輯。"
            }
          ]
        },
        {
          "lang": "zh_hant",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "以現代、全球的內容分發解決方案來設計的及時資產操作與傳遞層級。",
          "description": [
            "DADI CDN 是類似像是 Akamai 和 Limelight 的傳統 CDN（內容傳遞網路），專為執行處理作業與傳遞有關影像處理和資產傳遞（CSS／JavaScript／字型）的載量所設計，並可自動作為你核心產品頂層的層級。",
            "CDN 可完整支援快取、標頭控制、影像處理、影像壓縮及影像格式轉換。已驗證的 API 可允許以內容無效形式來為個人檔案或集體路徑基礎進行精細快取控制。 DADI Web 可使用多種範本語言，為你的資料展示提供簡易但強大的範本層。 這包含了 LinkedIn 的 Dust.js、Pug 或 Handlebars——或者你也可以輕鬆製作屬於你的。"
          ],
          "headlines": [
            "可由 Amazon S3、遠端伺服器或本地檔案系統供應",
            "可為響應式設計和行動裝置來動態生成影像",
            "廣大的影像強化和轉換工具套件",
            "影像格式轉換"
          ],
          "features": [
            {
              "title": "可根據題材來裁剪",
              "icon": "picture",
              "description": "讓內容傳遞網路決定影像焦點並傳遞只含基本要素、依你需求來裁切的內容"
            },
            {
              "title": "簡化媒體儲存空間",
              "icon": "database",
              "description": "無須將每張你所上傳到文章裡的影像維持多種尺寸大小——內容傳遞網路能從一張主影像產生各種新變化的版本"
            },
            {
              "title": "支援所有資產類型的內容傳遞網路",
              "icon": "layers",
              "description": "儲存、傳遞字型檔，並將你所有要傳遞的 CSS 和 Javascript 資產迷你化"
            },
            {
              "title": "智慧傳遞技術",
              "icon": "activity",
              "description": "讓內容傳遞網路選擇根據裝置、網路、地點或語言的最佳轉化"
            },
            {
              "title": "傳遞配置",
              "icon": "id",
              "description": "將常用的影像操作參數儲存為「影像參數傳遞配置」"
            },
            {
              "title": "可快取裁剪內容來獲得更快的傳遞速度",
              "icon": "bolt",
              "description": "轉換的影像檔可用 Redis 伺服器或本地檔案系統進行快取，為後續的請求提供更快的傳遞"
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Publish 可管理在 API 的儲存內容。"
            },
            {
              "product": "cdn",
              "description": "Publish 可用內容傳遞網路來儲存和操作影像。"
            },
            {
              "product": "web",
              "description": "Publish 可用 Web 服務來支援前端。"
            }
          ]
        },
        {
          "lang": "zh_hant",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "能以獨立平台或與 API 作為完整堆疊網路應用程式來作業的無綱要式模板層級。",
          "description": [
            "DADI Web 能讓建立自訂的企業級網路應用程式變得輕鬆。可輕鬆製作靜態網頁或連結到 API 來創造出數據驅動的應用程式，讓你在伺服器或瀏覽器內的資料搜尋、分頁、排序和過濾更加有力。",
            "DADI Web 可使用多種範本語言，提供簡單但有力的範本層級來顯示你的資料。這包含了 LinkedIn 的 Dust.js、Pug 或 Handlebars——或者你也可以輕鬆製作屬於你的。"
          ],
          "headlines": [
            "與 REST API 連結來產生數據驅動的網頁",
            "為你的資料進行搜尋、分頁、排序與過濾",
            "可輕鬆創造的靜態網頁",
            "可支援資料庫備份的工作階段"
          ],
          "features": [
            {
              "title": "靈活的樣板引擎支援",
              "icon": "chat-alt",
              "description": "可用 Web 服務預設的 Dust.js 模板引擎或者切換成 Pug.js 或 Handlebars.js——甚至創造屬於你自己的！"
            },
            {
              "title": "網址重寫支援",
              "icon": "duplicate",
              "description": "包含完整支援重新導向和 Proxy 處理的 Apache 配置風格網址重寫。"
            },
            {
              "title": "事件層級",
              "icon": "bolt",
              "description": "建立自訂的 JavaScript 事件來修改請求和回應，或根據來源載入的資訊來採取行動"
            },
            {
              "title": "支援各種資訊",
              "icon": "cloud",
              "description": "不僅限使用 DADI API 而已，你還能透過靜態的 Markdown 檔案來提供資料或者從 Twitter 和 WordPress 來擷取摘要資訊"
            },
            {
              "title": "預載資料",
              "icon": "fast-forward",
              "description": "在應用程式啟動時預載以加速常用資料的存取"
            },
            {
              "title": "快取網頁來更快擷取資訊",
              "icon": "performance",
              "description": "使用 Redis 伺服器或本地檔案系統來快取資料能為使用者提供更快的回應時間。包括對快取控制標頭的完整支援"
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Web 可顯示來自 API 的內容。"
            },
            {
              "product": "cdn",
              "description": "Web 使用內容傳遞網路來供應影像、CSS 和 JavaScript。"
            }
          ]
        },
        {
          "lang": "zh_hans",
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "高性能 RESTful API 层，其设计支持 API 优先开发和 COPE",
          "description": [
            "DADI API 一个快速设置数据层，可以充当数字平台的中枢。它被设计成可以插入到模板层、移动应用程序或者可用于任何其他数据使用端，并且可与 DADI 技术套件中的其他应用程序一起使用。",
            "它可以包含您的业务/领域逻辑（对现实世界业务规则编码的平台部分；这些规则确定数据的创建、显示、存储和更改的方式）。DADI API 可让您在几分钟内设置并运行一个完整的数据层。"
          ],
          "headlines": [
            "轻松筛选数据以及进行数据排序",
            "灵活的数据库支持",
            "自动文档版本控制",
            "内置 oAuth2 支持"
          ],
          "features": [
            {
              "title": "轻松筛选数据以及进行数据排序",
              "icon": "folder-open",
              "description": "驾驭 MongoDB 风格查询的力量来筛选数据以及进行数据排序。"
            },
            {
              "title": "灵活的数据库支持",
              "icon": "database",
              "description": "支持多个数据库连接器，其中包括 MongoDB、CouchDB 和 RethinkDB"
            },
            {
              "title": "自动建立数据库索引",
              "icon": "list",
              "description": "建立底层数据库索引很简单，将配置元素添加到集合中即可"
            },
            {
              "title": "自动输入验证",
              "icon": "happy",
              "description": "轻松配置集合中的字段以便进行输入验证"
            },
            {
              "title": "集合级访问控制",
              "icon": "locked",
              "description": "利用细粒度的授权层，控制谁可以访问数据以及访问方式"
            },
            {
              "title": "缓存数据以加快检索速度",
              "icon": "cloud-upload",
              "description": "使用 Redis 服务器或本地文件系统缓存数据，从而缩短响应时间"
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API 可以提供动态 Web 内容。"
            },
            {
              "product": "publish",
              "description": "Publish 提供在 API 中编辑内容的界面。"
            }
          ]
        },
        {
          "lang": "zh_hans",
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "写作者通往内容创作世界的一个窗口。灵活的界面，采用了编辑工作流程优化设计",
          "description": [
            "开发 DADI Publish 的目的是用可适应要求的灵活界面来优化编辑工作流程，从而可将更多时间用于制作内容，而不是将时间浪费在内容管理上。其构建目的是支持 COPE（一次创建，随处发布）原则。",
            "撰稿人和编辑人员可以从一个地方跨产品无缝管理输出，而工程师则可以让复杂的内容收集工作变得轻松。Publish 当前与 DADI API 配合使用，但开发路线图将很快允许其用于各种数据存储库。"
          ],
          "headlines": [
            "可扩展的自定义字段",
            "管理涉及多个 API 的文档",
            "直观的浏览器内编辑器，有简单的拖放工具",
            "后台任务，可管理大数据操作、分析等大量事项"
          ],
          "features": [
            {
              "title": "集中媒体管理",
              "icon": "picture",
              "description": "通过一个内容存储库支持一套数字产品。节约工程师和编辑人员等的时间和精力"
            },
            {
              "title": "文章发布日程安排",
              "icon": "time",
              "description": "预加载内容供在适合内容的某个非工作日时间自动发布。创作草稿供内部审阅"
            },
            {
              "title": "30 秒内设置并连接",
              "icon": "database",
              "description": "DADI API 的完美补充，使您只需几天或几周（而非几个月）就能投入运行。很快将用于其他数据存储库"
            },
            {
              "title": "自定义用户权限",
              "icon": "locked",
              "description": "大团队强化功能：让恰当的人负责系统的恰当部分。扩展后可支持编辑工作流程"
            },
            {
              "title": "协作文档编辑",
              "icon": "user-new",
              "description": "了解同事在共享文章中所处的位置，避免冲突：在更新内容时无缝合作"
            },
            {
              "title": "修订历史记录，可迅速还原",
              "icon": "rewind",
              "description": "提供完整的审核踪迹，可以恢复到任何时间点。列出文档差异，可了解更改概况"
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "API 可以提供 Web 内容。"
            },
            {
              "product": "publish",
              "description": "可以在 Publish 中编辑 API 中的内容。"
            }
          ]
        },
        {
          "lang": "zh_hans",
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "即时 (JIT) 素材处理和交付层，采用了现代化全球内容分发解决方案",
          "description": [
            "DADI CDN 类似于传统的 CDN（内容分发网络），如 Akamai 和 Limelight。其设计目的是承载与图像操作和素材交付（CSS/JS/字体）关联的处理和交付负荷，并自主发挥核心产品顶层的作用。",
            "CDN 完全支持缓存、标头控制、图像操作、图像压缩和图像格式转换。经过验证的 API 支持在单个文件或集体路径的基础上，以内容验证的形式实现细粒度缓存控制 DADI Web 可以使用各种模板语言，因此可以提供简单而强大的模板层来显示数据。其中包括 LinkedIn 的 Dust、Pug 或 Handlebars；您也可以轻松定制自己的模板。"
          ],
          "headlines": [
            "通过 Amazon S3、远程服务器或本地文件系统提供服务",
            "为快速响应设计和移动设备动态生成图像",
            "丰富的图像增强和转化工具集",
            "图像格式转换"
          ],
          "features": [
            {
              "title": "基于主题事项的裁剪",
              "icon": "picture",
              "description": "让 CDN 确定图像的焦点，交付仅包含必要信息的图像，按您的规格裁剪"
            },
            {
              "title": "简化的媒体存储",
              "icon": "database",
              "description": "不需要为您上传到文件中的每个图像维护多个尺寸：CDN 会根据单个主图像生成新的变体"
            },
            {
              "title": "一个 CDN 适用于所有素材类型",
              "icon": "layers",
              "description": "存储和交付字体文件，缩小所有 CSS 和 JavaScript 素材供交付。"
            },
            {
              "title": "智能交付",
              "icon": "activity",
              "description": "让 CDN 根据设备、网络、位置和语言选择最佳转化"
            },
            {
              "title": "交付配方",
              "icon": "id",
              "description": "将常用的图像操作参数另存为“交付配方”"
            },
            {
              "title": "裁剪缓存以加快交付速度",
              "icon": "bolt",
              "description": "可以使用 Redis 服务器或本地文件系统缓存转换后的图像，从而加快后续请求的交付速度"
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Publish 管理 API 中存储的内容。"
            },
            {
              "product": "cdn",
              "description": "Publish 使用 CDN 来存储和操作图像。"
            },
            {
              "product": "web",
              "description": "Publish 可以使用 Web 为前端服务。"
            }
          ]
        },
        {
          "lang": "zh_hans",
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "无模式模板层，可作为独立平台运行，也可作为完整的堆栈 Web 应用程序与 API 配合运行。",
          "description": [
            "利用 DADI Web 可以轻松构建自定义企业级 Web 应用程序。轻松创建静态页面或连接到 API 以生成数据驱动的应用程序，使您能够在服务器上或在浏览器中对数据执行搜索、分页、排序和筛选操作。", "DADI Web 可以使用各种模板语言，因此可以提供简单而强大的模板层来显示数据。其中包括 LinkedIn 的 Dust、Pug 或 Handlebars；您也可以轻松定制自己的模板。"
          ],
          "headlines": [
            "与 REST API 连接以生成数据驱动的页面",
            "对数据执行搜索、分页、排序和筛选操作",
            "轻松创建静态页面",
            "支持基于数据库的会话"
          ],
          "features": [
            {
              "title": "灵活的模板引擎支持",
              "icon": "chat-alt",
              "description": "使用 Web 默认的 Dust.js 模板引擎或者换成 Pug.js 或 Handlebars.js，甚至定制您自己的模板引擎！"
            },
            {
              "title": "URL 重写支持",
              "icon": "duplicate",
              "description": "包括 Apache 类的 URL 重写，完全支持重定向和代理。"
            },
            {
              "title": "事件层",
              "icon": "bolt",
              "description": "创建自定义 JavaScript 事件以修改请求和响应，或者根据从来源中加载的数据采取措施"
            },
            {
              "title": "来自任何地方的数据",
              "icon": "cloud",
              "description": "您不会受限于使用 DADI API：可以处理来自静态 Markdown 文件的数据，也可以从 Twitter 和 Wordpress 检索馈送内容"
            },
            {
              "title": "预加载数据",
              "icon": "fast-forward",
              "description": "通过在应用程序启动时预加载常用数据，加快访问速度"
            },
            {
              "title": "缓存页面以加快检索速度",
              "icon": "performance",
              "description": "使用 Redis 服务器或本地文件系统缓存数据，从而缩短对用户的响应时间。包括完全支持缓存控制标头"
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "Web 可以显示来自 API 的内容。"
            },
            {
              "product": "cdn",
              "description": "Web 使用 CDN 来处理图像、CSS 和 JS。"
            }
          ]
        }
      ]
    }
  }
}
